app/controllers/file_uploads_controller.rb

UPDATE "file_uploads" SET "public_token" = ?, "updated_at" = ? WHERE "file_uploads"."id" = ?  [["public_token", "[FILTERED]"], ["updated_at", "2024-12-16 18:06:06.248159"], ["id", 3]]
---
  def share
    @file_upload.update(public_token: SecureRandom.urlsafe_base64(8))