app/controllers/file_uploads_controller.rb

INSERT INTO "file_uploads" ("title", "description", "file_type", "public_token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @file_upload = current_user.file_uploads.new(file_upload_params)
    if @file_upload.save

DELETE FROM "file_uploads" WHERE "file_uploads"."id" = ?  [["id", 1]]
---
  def destroy
    @file_upload.destroy

SELECT "file_uploads".* FROM "file_uploads" WHERE "file_uploads"."user_id" = ? AND "file_uploads"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def share
    @file_upload = current_user.file_uploads.find(params[:id])
    @file_upload.generate_public_token unless @file_upload.public_token.present?

SELECT "file_uploads".* FROM "file_uploads" WHERE "file_uploads"."public_token" = ? LIMIT ?  [["public_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def public_show
    @file_upload = FileUpload.find_by(public_token: params[:token])

SELECT "file_uploads".* FROM "file_uploads" WHERE "file_uploads"."user_id" = ? AND "file_uploads"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def set_file_upload
    @file_upload = current_user.file_uploads.find(params[:id])