app/controllers/public_files_controller.rb

SELECT "file_uploads".* FROM "file_uploads" WHERE "file_uploads"."public_token" = ? LIMIT ?  [["public_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def show
    @file_upload = FileUpload.find_by(public_token: params[:token])